IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/C2000/f28p65x_epg_mux_regs.xml
<module id="EPG_MUX_REGS" HW_revision="" description="EPG MUX Registers">
	<register id="EPGMXSEL0" width="32" page="1" offset="0x0" internal="0" description="EPG Mux select register 0">
		<bitfield id="SEL0" description="DATAOUT[0] mux select." begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="SEL1" description="DATAOUT[1] mux select." begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="SEL2" description="DATAOUT[2] mux select." begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="SEL3" description="DATAOUT[3] mux select." begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="SEL4" description="DATAOUT[4] mux select." begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="SEL5" description="DATAOUT[5] mux select." begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="SEL6" description="DATAOUT[6] mux select." begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="SEL7" description="DATAOUT[7] mux select." begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="SEL8" description="DATAOUT[8] mux select." begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="SEL9" description="DATAOUT[9] mux select." begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="SEL10" description="DATAOUT[10] mux select." begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="SEL11" description="DATAOUT[11] mux select." begin="11" end="11" width="1" rwaccess="RW"/>
		<bitfield id="SEL12" description="DATAOUT[12] mux select." begin="12" end="12" width="1" rwaccess="RW"/>
		<bitfield id="SEL13" description="DATAOUT[13] mux select." begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="SEL14" description="DATAOUT[14] mux select." begin="14" end="14" width="1" rwaccess="RW"/>
		<bitfield id="SEL15" description="DATAOUT[15] mux select." begin="15" end="15" width="1" rwaccess="RW"/>
		<bitfield id="SEL16" description="DATAOUT[16] mux select." begin="16" end="16" width="1" rwaccess="RW"/>
		<bitfield id="SEL17" description="DATAOUT[17] mux select." begin="17" end="17" width="1" rwaccess="RW"/>
		<bitfield id="SEL18" description="DATAOUT[18] mux select." begin="18" end="18" width="1" rwaccess="RW"/>
		<bitfield id="SEL19" description="DATAOUT[19] mux select." begin="19" end="19" width="1" rwaccess="RW"/>
		<bitfield id="SEL20" description="DATAOUT[20] mux select." begin="20" end="20" width="1" rwaccess="RW"/>
		<bitfield id="SEL21" description="DATAOUT[21] mux select." begin="21" end="21" width="1" rwaccess="RW"/>
		<bitfield id="SEL22" description="DATAOUT[22] mux select." begin="22" end="22" width="1" rwaccess="RW"/>
		<bitfield id="SEL23" description="DATAOUT[23] mux select." begin="23" end="23" width="1" rwaccess="RW"/>
		<bitfield id="SEL24" description="DATAOUT[24] mux select." begin="24" end="24" width="1" rwaccess="RW"/>
		<bitfield id="SEL25" description="DATAOUT[25] mux select." begin="25" end="25" width="1" rwaccess="RW"/>
		<bitfield id="SEL26" description="DATAOUT[26] mux select." begin="26" end="26" width="1" rwaccess="RW"/>
		<bitfield id="SEL27" description="DATAOUT[27] mux select." begin="27" end="27" width="1" rwaccess="RW"/>
		<bitfield id="SEL28" description="DATAOUT[28] mux select." begin="28" end="28" width="1" rwaccess="RW"/>
		<bitfield id="SEL29" description="DATAOUT[29] mux select." begin="29" end="29" width="1" rwaccess="RW"/>
		<bitfield id="SEL30" description="DATAOUT[30] mux select." begin="30" end="30" width="1" rwaccess="RW"/>
		<bitfield id="SEL31" description="DATAOUT[31] mux select." begin="31" end="31" width="1" rwaccess="RW"/>
	</register>
	<register id="EPGMXSELLOCK" width="32" page="1" offset="0xc" internal="0" description="EPG Mux select register lock">
		<bitfield id="EPGMXSEL0" description="EPGMXSEL0 lock bit" begin="0" end="0" width="1" rwaccess="RW"/>
	</register>
	<register id="EPGMXSELCOMMIT" width="32" page="1" offset="0xe" internal="0" description="EPG Mux select register commit">
		<bitfield id="EPGMXSEL0" description="EPGMXSEL0 commit bit" begin="0" end="0" width="1" rwaccess="RW"/>
	</register>
</module>
